import ReactPlayer from "react-player";
import { NavLink } from "react-router-dom";

const About = () => {
  return (
    <div>
      <div className="flex items-center justify-between mx-auto container px-[5%] py-9 flex-wrap">
        <div className="w-full md:w-[50%] space-y-3 mb-8 md:mb-0">
          <h1 className="font-semibold text-[30px] text-green-600">
            Компания ҳақида
          </h1>
          <div>
            <p className="font-medium text-[15px] sm:text-[12px] md:text-[15px]">
              Маълумки, республикамизда қишлоқ хўжалиги соҳасига бўлган эътибор
              шиддат билан ривожланиб бормоқда. Агро кластер ва фермер
              хўжаликларининг ташкил этилаётгани бунга яққол мисол бўла олади.
              Мамлакатимизда сифатли озиқ-овқат маҳсулотларини етиштиришда аҳоли
              саломатлиги ва хавфсизлигини таъминлаш мақсадида "AgroCom"
              компанияси таркибига кирувчи “Agro Alliance Group” ва “Agro Aziя
              Group” МЧЖлари ҳозирги замон талабларига жавоб берадиган, арзон ва
              самарадорлиги юқори бўлган ўсимликларни зараркунандалар,
              касалликлар ва бегона ўтлардан ҳимоя қилишга ёрдам берадиган
              кимёвий ва биологик маҳсулотлар (инсектицидлар, гербицидлар,
              фунгицидлар ва акарицидлар), органик ҳамда минерал ўғитлар ва
              биостимуляторларни етказиб бериб келмоқда. Бизнинг мақсадимиз —
              деҳқон ва фермер хўжаликларида етиштирилаётган қишлоқ хўжалик
              экинларини зараркунандалар, касалликлар ва бегона ўтлардан ҳимоя
              қилишда, ҳосилдорлик салмоғини ҳамда сифат кўрсаткичларини янада
              оширишда қўлимиздан келганча ёрдам беришдир. Бундан ташқари,
              "AgroCom" компанияси янги технологияларни жорий этиш ва инновацион
              ечимларни амалиётга татбиқ қилиш орқали мижозларимизга замонавий
              ва экологик тоза маҳсулотларни таклиф этади. Шунингдек, биз
              фермерлар учун мунтазам ўқув-семинарлар уюштириш, турли
              машваратлар ўтказиш ва уларнинг эҳтиёжларини ўрганишга катта
              эътибор қаратамиз. Келажакда компаниямиз қишлоқ хўжалиги соҳасида
              жаҳон бозорида ўз ўрнини янада мустаҳкамлашни, экспорт кўламини
              кенгайтиришни ҳамда янги турдаги маҳсулотларни ишлаб чиқаришни
              режалаштирмоқда.
            </p>
          </div>
          <div>
            <NavLink to="/about">
              <button className="text-green-600 font-medium">Батафсил</button>
            </NavLink>
          </div>
        </div>
        <div className="w-full md:w-[50%] flex justify-center border p-3">
          <ReactPlayer
            url="https://www.youtube.com/watch?v=duDOjHJ1j5w"
            controls
            width="100%"
            height="400px"
          />
        </div>
      </div>
    </div>
  );
};

export default About;
